## Plan Result (prod-enterprise)




<pre><code>Plan: 108 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.environment[&#34;demo&#34;].azuread_application.app
  * module.environment[&#34;demo&#34;].azuread_application_password.token
  * module.environment[&#34;demo&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;demo&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;demo&#34;].azuread_group_member.acr
  * module.environment[&#34;demo&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;demo&#34;].azuread_service_principal.sp
  * module.environment[&#34;demo&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;demo&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;demo&#34;].azurerm_resource_group.rg
  * module.environment[&#34;demo&#34;].random_uuid.app_uuid
  * module.environment[&#34;demo&#34;].time_rotating.one_year
  * module.environment[&#34;dev&#34;].azuread_application.app
  * module.environment[&#34;dev&#34;].azuread_application_password.token
  * module.environment[&#34;dev&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;dev&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;dev&#34;].azuread_group_member.acr
  * module.environment[&#34;dev&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;dev&#34;].azuread_service_principal.sp
  * module.environment[&#34;dev&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;dev&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;dev&#34;].azurerm_resource_group.rg
  * module.environment[&#34;dev&#34;].random_uuid.app_uuid
  * module.environment[&#34;dev&#34;].time_rotating.one_year
  * module.environment[&#34;ithc&#34;].azuread_application.app
  * module.environment[&#34;ithc&#34;].azuread_application_password.token
  * module.environment[&#34;ithc&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ithc&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;ithc&#34;].azuread_group_member.acr
  * module.environment[&#34;ithc&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;ithc&#34;].azuread_service_principal.sp
  * module.environment[&#34;ithc&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;ithc&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;ithc&#34;].azurerm_resource_group.rg
  * module.environment[&#34;ithc&#34;].random_uuid.app_uuid
  * module.environment[&#34;ithc&#34;].time_rotating.one_year
  * module.environment[&#34;prod&#34;].azuread_application.app
  * module.environment[&#34;prod&#34;].azuread_application_password.token
  * module.environment[&#34;prod&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;prod&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;prod&#34;].azuread_group_member.acr
  * module.environment[&#34;prod&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;prod&#34;].azuread_service_principal.sp
  * module.environment[&#34;prod&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;prod&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;prod&#34;].azurerm_resource_group.rg
  * module.environment[&#34;prod&#34;].random_uuid.app_uuid
  * module.environment[&#34;prod&#34;].time_rotating.one_year
  * module.environment[&#34;ptl&#34;].azuread_application.app
  * module.environment[&#34;ptl&#34;].azuread_application_password.token
  * module.environment[&#34;ptl&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ptl&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;ptl&#34;].azuread_group_member.acr
  * module.environment[&#34;ptl&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;ptl&#34;].azuread_service_principal.sp
  * module.environment[&#34;ptl&#34;].azuredevops_serviceendpoint_azurerm.ptl_endpoint[0]
  * module.environment[&#34;ptl&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;ptl&#34;].azurerm_resource_group.rg
  * module.environment[&#34;ptl&#34;].random_uuid.app_uuid
  * module.environment[&#34;ptl&#34;].time_rotating.one_year
  * module.environment[&#34;ptlsbox&#34;].azuread_application.app
  * module.environment[&#34;ptlsbox&#34;].azuread_application_password.token
  * module.environment[&#34;ptlsbox&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ptlsbox&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;ptlsbox&#34;].azuread_group_member.acr
  * module.environment[&#34;ptlsbox&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;ptlsbox&#34;].azuread_service_principal.sp
  * module.environment[&#34;ptlsbox&#34;].azuredevops_serviceendpoint_azurerm.ptlsbox_endpoint[0]
  * module.environment[&#34;ptlsbox&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;ptlsbox&#34;].azurerm_resource_group.rg
  * module.environment[&#34;ptlsbox&#34;].random_uuid.app_uuid
  * module.environment[&#34;ptlsbox&#34;].time_rotating.one_year
  * module.environment[&#34;sbox&#34;].azuread_application.app
  * module.environment[&#34;sbox&#34;].azuread_application_password.token
  * module.environment[&#34;sbox&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;sbox&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;sbox&#34;].azuread_group_member.acr
  * module.environment[&#34;sbox&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;sbox&#34;].azuread_service_principal.sp
  * module.environment[&#34;sbox&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;sbox&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;sbox&#34;].azurerm_resource_group.rg
  * module.environment[&#34;sbox&#34;].random_uuid.app_uuid
  * module.environment[&#34;sbox&#34;].time_rotating.one_year
  * module.environment[&#34;stg&#34;].azuread_application.app
  * module.environment[&#34;stg&#34;].azuread_application_password.token
  * module.environment[&#34;stg&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;stg&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;stg&#34;].azuread_group_member.acr
  * module.environment[&#34;stg&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;stg&#34;].azuread_service_principal.sp
  * module.environment[&#34;stg&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;stg&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;stg&#34;].azurerm_resource_group.rg
  * module.environment[&#34;stg&#34;].random_uuid.app_uuid
  * module.environment[&#34;stg&#34;].time_rotating.one_year
  * module.environment[&#34;test&#34;].azuread_application.app
  * module.environment[&#34;test&#34;].azuread_application_password.token
  * module.environment[&#34;test&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;test&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;test&#34;].azuread_group_member.acr
  * module.environment[&#34;test&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;test&#34;].azuread_service_principal.sp
  * module.environment[&#34;test&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;test&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;test&#34;].azurerm_resource_group.rg
  * module.environment[&#34;test&#34;].random_uuid.app_uuid
  * module.environment[&#34;test&#34;].time_rotating.one_year




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.environment["demo"].azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Operations (env:demo)"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Operations (env:demo) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Operations (env:demo)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Operations (env:demo) on your behalf."
              + user_consent_display_name  = "Access DTS Operations (env:demo)"
              + value                      = "user_impersonation"
            }
        }

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
        }

      + web {
          + homepage_url = "https://dev.azure.com/hmcts/PlatformOperations"
        }
    }

  # module.environment["demo"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.environment["demo"].azuread_group.groups["DNS Zone Contributor"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants dns zone contributor permissions to the demo environment"
      + display_name                   = "DTS Public DNS Contributor (env:demo)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.environment["demo"].azuread_group.groups["DTS Operations"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "demo Operations elevated access"
      + display_name                   = "DTS Operations (env:demo)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.environment["demo"].azuread_group_member.acr will be created
  + resource "azuread_group_member" "acr" {
      + group_object_id  = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.environment["demo"].azuread_group_member.dns_zone_contributor will be created
  + resource "azuread_group_member" "dns_zone_contributor" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.environment["demo"].azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.environment["demo"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be created
  + resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
      + authorization             = (known after apply)
      + azurerm_spn_tenantid      = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + azurerm_subscription_id   = "c68a4bed-4c3d-4956-af51-4ae164c1957c"
      + azurerm_subscription_name = "DTS-SHAREDSERVICES-DEMO"
      + description               = "Managed by Terraform"
      + id                        = (known after apply)
      + project_id                = "PlatformOperations"
      + service_endpoint_name     = "OPS-APPROVAL-GATE-DEMO-ENVS"

      + credentials {
          + serviceprincipalid       = (known after apply)
          + serviceprincipalkey      = (sensitive value)
          + serviceprincipalkey_hash = (sensitive value)
        }
    }

  # module.environment["demo"].azurerm_app_service_plan.asp will be created
  + resource "azurerm_app_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = "FunctionApp"
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "enterprise-demo-asp"
      + reserved                     = false
      + resource_group_name          = "enterprise-demo-rg"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + sku {
          + capacity = (known after apply)
          + size     = "Y1"
          + tier     = "Dynamic"
        }
    }

  # module.environment["demo"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "enterprise-demo-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
    }

  # module.environment["demo"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.environment["demo"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["dev"].azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Operations (env:dev)"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Operations (env:dev) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Operations (env:dev)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Operations (env:dev) on your behalf."
              + user_consent_display_name  = "Access DTS Operations (env:dev)"
              + value                      = "user_impersonation"
            }
        }

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
        }

      + web {
          + homepage_url = "https://dev.azure.com/hmcts/PlatformOperations"
        }
    }

  # module.environment["dev"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.environment["dev"].azuread_group.groups["DNS Zone Contributor"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants dns zone contributor permissions to the dev environment"
      + display_name                   = "DTS Public DNS Contributor (env:dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.environment["dev"].azuread_group.groups["DTS Operations"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "dev Operations elevated access"
      + display_name                   = "DTS Operations (env:dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.environment["dev"].azuread_group_member.acr will be created
  + resource "azuread_group_member" "acr" {
      + group_object_id  = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.environment["dev"].azuread_group_member.dns_zone_contributor will be created
  + resource "azuread_group_member" "dns_zone_contributor" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.environment["dev"].azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.environment["dev"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be created
  + resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
      + authorization             = (known after apply)
      + azurerm_spn_tenantid      = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + azurerm_subscription_id   = "867a878b-cb68-4de5-9741-361ac9e178b6"
      + azurerm_subscription_name = "DTS-SHAREDSERVICES-DEV"
      + description               = "Managed by Terraform"
      + id                        = (known after apply)
      + project_id                = "PlatformOperations"
      + service_endpoint_name     = "OPS-APPROVAL-GATE-DEV-ENVS"

      + credentials {
          + serviceprincipalid       = (known after apply)
          + serv

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ct_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.environment["stg"].azuread_group.groups["DNS Zone Contributor"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants dns zone contributor permissions to the stg environment"
      + display_name                   = "DTS Public DNS Contributor (env:stg)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.environment["stg"].azuread_group.groups["DTS Operations"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "stg Operations elevated access"
      + display_name                   = "DTS Operations (env:stg)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.environment["stg"].azuread_group_member.acr will be created
  + resource "azuread_group_member" "acr" {
      + group_object_id  = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.environment["stg"].azuread_group_member.dns_zone_contributor will be created
  + resource "azuread_group_member" "dns_zone_contributor" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.environment["stg"].azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.environment["stg"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be created
  + resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
      + authorization             = (known after apply)
      + azurerm_spn_tenantid      = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + azurerm_subscription_id   = "74dacd4f-a248-45bb-a2f0-af700dc4cf68"
      + azurerm_subscription_name = "DTS-SHAREDSERVICES-STG"
      + description               = "Managed by Terraform"
      + id                        = (known after apply)
      + project_id                = "PlatformOperations"
      + service_endpoint_name     = "OPS-APPROVAL-GATE-STG-ENVS"

      + credentials {
          + serviceprincipalid       = (known after apply)
          + serviceprincipalkey      = (sensitive value)
          + serviceprincipalkey_hash = (sensitive value)
        }
    }

  # module.environment["stg"].azurerm_app_service_plan.asp will be created
  + resource "azurerm_app_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = "FunctionApp"
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "enterprise-stg-asp"
      + reserved                     = false
      + resource_group_name          = "enterprise-stg-rg"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + sku {
          + capacity = (known after apply)
          + size     = "Y1"
          + tier     = "Dynamic"
        }
    }

  # module.environment["stg"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "enterprise-stg-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.environment["stg"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.environment["stg"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["test"].azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Operations (env:test)"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Operations (env:test) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Operations (env:test)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Operations (env:test) on your behalf."
              + user_consent_display_name  = "Access DTS Operations (env:test)"
              + value                      = "user_impersonation"
            }
        }

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
        }

      + web {
          + homepage_url = "https://dev.azure.com/hmcts/PlatformOperations"
        }
    }

  # module.environment["test"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.environment["test"].azuread_group.groups["DNS Zone Contributor"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants dns zone contributor permissions to the test environment"
      + display_name                   = "DTS Public DNS Contributor (env:test)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.environment["test"].azuread_group.groups["DTS Operations"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "test Operations elevated access"
      + display_name                   = "DTS Operations (env:test)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.environment["test"].azuread_group_member.acr will be created
  + resource "azuread_group_member" "acr" {
      + group_object_id  = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.environment["test"].azuread_group_member.dns_zone_contributor will be created
  + resource "azuread_group_member" "dns_zone_contributor" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.environment["test"].azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.environment["test"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be created
  + resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
      + authorization             = (known after apply)
      + azurerm_spn_tenantid      = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + azurerm_subscription_id   = "3eec5bde-7feb-4566-bfb6-805df6e10b90"
      + azurerm_subscription_name = "DTS-SHAREDSERVICES-TEST"
      + description               = "Managed by Terraform"
      + id                        = (known after apply)
      + project_id                = "PlatformOperations"
      + service_endpoint_name     = "OPS-APPROVAL-GATE-TEST-ENVS"

      + credentials {
          + serviceprincipalid       = (known after apply)
          + serviceprincipalkey      = (sensitive value)
          + serviceprincipalkey_hash = (sensitive value)
        }
    }

  # module.environment["test"].azurerm_app_service_plan.asp will be created
  + resource "azurerm_app_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = "FunctionApp"
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "enterprise-test-asp"
      + reserved                     = false
      + resource_group_name          = "enterprise-test-rg"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + sku {
          + capacity = (known after apply)
          + size     = "Y1"
          + tier     = "Dynamic"
        }
    }

  # module.environment["test"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "enterprise-test-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
    }

  # module.environment["test"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.environment["test"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 108 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->